app/Http/Controllers/ListingController.php

SELECT * FROM `listings` WHERE `tags` like '%backend%' ORDER BY `created_at` DESC
---
    public function index() {
        return view('listings.index', [
            'listings' => Listing::latest()->filter(request(['tag', 'search']))->get()
        ]);

INSERT INTO `listings` (`title`, `company`, `location`, `website`, `email`, `tags`, `description`, `updated_at`, `created_at`) VALUES ('Senior Coffee Getter', 'Company 1', 'Boston, London, Des Moines', 'www.ifetch.com', 'coffee_fetcher239@getalattethisguy.com', 'Coffee, Java, Subservience', 'Get stuff do stuff get paid', '2022-12-19 15:36:49', '2022-12-19 15:36:49')
---
    public function store(Request $request) {
        $formFields = $request->validate([
            'title' => 'required',
            'company' => ['required', Rule::unique('listings', 'company')],
            'location' => 'required',
            'website' => 'required',
            'email' => ['required', 'email'],
            'tags' => 'required',
            'description' => 'required'
        ]);

        Listing::create($formFields);